"""
חלק א' סעיף ב' שאלה 3

מילון ראשון - ניהול הנתונים לפי שעות:
המילון מחולק לפי שעות, כשכל מפתח מייצג שעה מסוימת עם תאריך של אותו יום
לכל שעה יש ערך שמכיל:
sum: סכום הערכים שנאספו עבור אותה שעה
count: מספר הערכים שנאספו

מילון שני - בדיקת כפילויות
מילון נוסף שבו כל מפתח הוא חותמת זמן (timestamp) שמציינת נתונים שכבר נקלטו.
כאשר מתקבל נתון חדש, אני קודם כל בודקת האם חותמת הזמן שלו קיימת במילון הכפילויות.
אם כן, אני מוחקת את הנתון הזה וגם את הערך הכפול הקודם מהמילון של הנתונים לפי שעות.
(כיון שיש פה סתירה של נתונים ולכן נמחק את שתיהם)
בנוסף, אני מעדכנת את המילון של הכפילויות כך שחותמת הזמן תקבל ערך -1, כדי לסמן שכבר טופלה ולא תימחק שוב אם תגיע שוב.

בכל פעם שזורם נתון חדש, המערכת בודקת אם חותמת הזמן שלו קיימת במילון הכפילויות. אם היא לא קיימת,
הנתון מתווסף למילון לפי השעה המתאימה, ומעודכן גם במילון הכפילויות עם הערך של אותה השעה.
אם הנתון קיים,
הוא נמחק מהמילון הראשון (מממוצעי השעה) , ולאחר מכן מסמנים את החותמת עם ערך -1 במילון הכפילויות ולא נוסיף למילון השעות.

אחת לשעה, אני מחשבת את הממוצע עבור כל שעה במילון על ידי חלוקת סכום הנתונים במספרם (sum/count).
את הממוצע אני רושמת לקובץ חיצוני, שבו מצוינת השעה והממוצע שלה.

לאחר חישוב הממוצע וכתיבתו לקובץ,
אני מוחקת את נתוני השעה הישנה מהמילון של הנתונים לפי שעות וגם מהמילון של הכפילויות. כך אני שומרת על יעילות זיכרון.

"""
